function About() {
  return (
    <section className="content-container" style={{gap: '20px'}}>
      <h2 className='title-h2'>Обо мне</h2>
      <p className='main-text'>
        По окончании 11 класса я поступил в НГУЭУ и одновременно с этим начал увлекаться программированием. Во время обучения в ВУЗе я решил для себя что хочу связать свою карьеру с веб-разработкой и последние 2 года я плотно взялся за программирование. Поначалу я взял фокус на backend разработку.  Моим стеком были Python, Django, а также PostgreSQL. Во время изучения Django я познакомился с SSR, а там и с JavaScript.
      </p>
      
      <p className="main-text">
        JS меня заинтересовал своей возможностью реализовывать backend и frontend проекты, так сказать не отходя от кассы.  Я стал делать проекты на node, постепенно начал разрабатывать на TypeScript и NestJS и вот неожиданно для себя я начал изучать frontend разработку и делать проекты на React &#128578;
      </p>
      
      <p className="main-text">
        Сейчас, после того как я пометался от технологии к технологии, я по итогу решил углубленно заняться frontend разработкой и теперь я держу курс на то, чтобы стать профессиональным frontend разработчиком, а в дальнейшем и fullstack специалистом. 
      </p>
    </section>
  )
}

export default About;

